app/Controllers/OrderController.php

    public function index()
    {
        $pendingOrders = $this->orderModel->where('status', 'pending')->findAll();

        $data['orders'] = $this->orderModel->findAll();
---
SELECT *
FROM `orders`
WHERE `status` = 'pending'
SELECT *
FROM `orders`