app/Controllers/Toko.php

SELECT *
FROM `barang`
SELECT *
FROM `keranjang`
SELECT *
FROM `orders`
---
    public function tampilan()
    {
        $data['barang'] = $this->barangModel->findAll();
        $data['keranjang'] = $this->keranjangModel->findAll();
        $data['orders'] = $this->orderModel->findAll();